import React from 'react';
import './App.scss';
import Header from './components/header/Header';
import Footer from './components/footer/Footer';

function App() {
  return (
    <div className='App'>
        <div className="container">
          <h1>Институт компьютерных наук и прикладной математики</h1>
            <h2>О нас</h2>
              <p>Факультет компьютерных наук и прикладной математики является одним из ведущих образовательных и научных центров в области компьютерных наук и прикладной математики. Мы предлагаем высококачественное образование, активно занимаемся научной деятельностью и подготавливаем квалифицированных специалистов, готовых к вызовам современного информационного общества.</p>

              <h3>История факультета и его достижения</h3>
              <p>Факультет компьютерных наук и прикладной математики имеет богатую историю, которая насчитывает множество значимых достижений. Мы гордимся нашими выпускниками, которые успешно работают в различных сферах индустрии и науки. Наш факультет также известен своими научными исследованиями, которые вносят важный вклад в развитие компьютерных наук и прикладной математики.</p>

              <h3>Миссия и цели факультета</h3>
              <p>Миссия нашего факультета заключается в предоставлении студентам высококачественного образования в области компьютерных наук и прикладной математики, развитии научной деятельности и подготовке специалистов, способных эффективно применять свои знания и навыки в практической деятельности. Мы стремимся к активному взаимодействию с индустрией и академическими организациями, чтобы обеспечить нашим студентам современное образование, соответствующее требованиям рынка труда.</p>

              <h3>Преподавательский состав и их квалификации</h3>
              <p>В нашем факультете работает высококвалифицированный преподавательский состав, состоящий из профессоров, доцентов и научных сотрудников. Наши преподаватели обладают обширным опытом в области компьютерных наук и прикладной математики, активно участвуют в научной деятельности и постоянно совершенствуют свои знания и навыки. Мы гордимся нашим преподавательским составом, который обеспечивает качественное обучение и поддержку наших студентов.</p>

              <h3>Партнеры и сотрудничество</h3>
              <p>Мы активно сотрудничаем с ведущими компаниями и академическими организациями, чтобы создать условия для практического применения знаний и навыков наших студентов. Наше партнерство включает совместные исследовательские проекты, стажировки и практики, организацию гостевых лекций и многое другое. Это позволяет нашим студентам получать ценный опыт работы в реальных проектах и устанавливать контакты с профессионалами в своей области.</p>

            <h2>Программы обучения</h2>
              <p>На факультете компьютерных наук и прикладной математики предлагаются <a href=''>разнообразные программы обучения</a>, позволяющие студентам получить высококачественное образование на разных уровнях.</p>

              <h3>Бакалавриат, магистратура и докторантура</h3>
              <p>Мы предлагаем программы бакалавриата, магистратуры и докторантуры в области компьютерных наук и прикладной математики. Наши образовательные программы разработаны с учетом современных тенденций и требований рынка труда, позволяют студентам получить глубокие знания и навыки, необходимые для успешной карьеры в области информационных технологий и научных исследований.</p>

              <h3>Курсы и специализации</h3>
              <p>Мы предлагаем различные курсы и специализации, которые позволяют студентам углубить свои знания в конкретных областях компьютерных наук и прикладной математики. Наши курсы основаны на современных методах преподавания и включают практические занятия, проекты и лабораторные работы, чтобы студенты могли применять свои знания на практике и развивать свои навыки.</p>

              <h3>Карьерные возможности и успехи выпускников</h3>
              <p>Наши выпускники имеют широкие карьерные возможности и достигают успехов в различных областях. Они трудятся в ведущих IT-компаниях, научных и исследовательских организациях, стартапах и государственных учреждениях. Наша программа обучения обеспечивает выпускников сильными навыками программирования, аналитического мышления, проблемного решения и коммуникации, что делает их конкурентоспособными на рынке труда.

              <h3>Процесс поступления и требования к абитуриентам</h3>
              <p>Для поступления на наш факультет необходимо пройти конкурсный отбор, который включает в себя вступительные экзамены по математике и информатике. Мы также оцениваем академические достижения и интересы абитуриентов в области компьютерных наук и прикладной математики. Подробную информацию о процессе поступления и требованиях к абитуриентам можно найти на нашем официальном сайте.</p>

            <h2>Наука и исследования</h2>
              <p>На факультете компьютерных наук и прикладной математики мы активно занимаемся научной деятельностью и проводим исследования в различных областях.</p>

              <h3>Фокусные области исследований</h3>
              <p>Наши исследования фокусируются на таких областях, как искусственный интеллект, машинное обучение, вычислительная математика, криптография, биоинформатика и другие. Мы стремимся к разработке новых методов и алгоритмов, которые могут применяться в различных сферах, включая бизнес, медицину, транспорт, науку и технологии.</p>

              <h3>Лаборатории и исследовательские группы</h3>
              <p>У нас есть собственные лаборатории и исследовательские группы, где студенты и преподаватели ведут исследования и работают над проектами. Наша инфраструктура обеспечивает доступ к современным вычислительным ресурсам и специализированному оборудованию, необходимому для проведения качественных научных исследований.</p>

              <h3>Научные проекты и публикации</h3>
              <p>Мы активно участвуем в научных проектах и публикуем результаты наших исследований в научных журналах и конференциях. Наши научные достижения признаны и получили признание в научном сообществе. Мы поощряем студентов участвовать в научных проектах и публиковать свои работы, чтобы развивать их научный потенциал и подготавливать их к успешной научной карьере.</p>

              <h3>Сотрудничество с индустрией и академическими организациями</h3>
              <p>Мы активно сотрудничаем с ведущими компаниями и академическими организациями, чтобы применять наши научные результаты в реальных проектах и создавать инновационные решения. Наше сотрудничество включает совместные исследовательские проекты, обмен экспертами и ресурсами, организацию семинаров и конференций. Мы стремимся к тесному взаимодействию с индустрией, чтобы обеспечить практическое применение наших научных разработок и подготовку студентов к требованиям рынка труда.</p>

            <h2>Студенческая жизнь</h2>
              <p>На факультете компьютерных наук и прикладной математики мы создаем благоприятную среду для активной и насыщенной студенческой жизни.</p>

              <h3>Кампус и обстановка на факультете</h3>
              <p>Наш факультет расположен в современном кампусе, который предоставляет комфортные условия для учебы и проведения активностей. Мы имеем современные учебные классы, компьютерные лаборатории и пространства для работы и общения студентов.</p>

              <h3>Студенческие клубы и организации</h3>
              <p>У нас есть различные студенческие клубы и организации, которые предлагают разнообразные мероприятия и активности. Студенты могут присоединиться к клубам, связанным с компьютерными науками, программированием, робототехникой и другими интересующими их областями. Это предоставляет возможность расширить свои знания, развить навыки работы в команде и наладить новые связи.</p>

              <h3>Мероприятия и специальные события</h3>
              <p>Мы организуем различные мероприятия и специальные события для студентов. Это включает научные конференции, семинары, мастер-классы, хакатоны, спортивные соревнования, культурные мероприятия и другие. Такие мероприятия позволяют студентам показать свои достижения, обменяться опытом, укрепить связи с профессионалами и насладиться активной студенческой жизнью.</p>

              <h3>Стипендии, гранты и другие возможности финансовой поддержки</h3>
              <p>Мы предлагаем студентам различные возможности для финансовой поддержки, включая стипендии, гранты и другие программы. Мы ценим академические достижения, таланты и вовлеченность студентов в научные исследования и внеучебную деятельность. Наша цель - сделать образование доступным и поддержать студентов в их учебе и развитии.</p>

              Мы гордимся нашим факультетом, его достижениями, преподавательским составом и студенческой общностью. Мы приглашаем вас <a href=''>присоединиться к нам</a> и стать частью нашего активного и инновационного сообщества студентов и преподавателей компьютерных наук и прикладной математики.
              </p>
        </div>

        <Footer />
    </div>
  );
}

export default App;